mohamed-soubhi/bootlab-esp/esp_idf/sdkconfig.defaults
# bootlab-esp — BL-020 sdkconfig defaults
#
# Task watchdog must PANIC (reset the chip), not just log, so the "hang"
# variant actually resets within 10s per PLAN Sec 5.3.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# Board: ESP32-S3, 16MB quad flash, 8MB embedded PSRAM (rig.yaml)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Default (single-app) partition table for BL-020's build/blink/watchdog
# verification only. BL-021 replaces this with the real OTA partitions.csv
# (ota_0/ota_1/otadata) -- deliberately out of scope here.

# Console over USB-Serial-JTAG, not the default UART0 -- this is the only
# console physically reachable over the boards' USB connector, and matches
# PLAN Sec 7.3.4's intent (LABID/console read directly from USB-Serial-JTAG,
# not UART0/stdin). Without this, all esp_log/printf output -- including
# the standard IDF boot banner -- goes to physical UART0 pins nobody is
# connected to, which is what happened on this project's first real flash.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
